# Importing Libraries

In [1]:
import pandas as pd
import numpy as np

# Create Sample Data

In [4]:
data = {
    'A' : [1, 2, np.nan, 4, 5],
    'B' : [np.nan, 2, 3, np.nan, 5],
    'C' : [1, np.nan, np.nan, 4, 5],
    'D' : [1,2,3,4,5]
} 
df = pd.DataFrame(data)

df.head()

     A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  NaN  2
2  NaN  3.0  NaN  3
3  4.0  NaN  4.0  4
4  5.0  5.0  5.0  5

# Check Null

In [12]:
display(
    df.isnull() \
    # .sum()
    )
df.info()

       A      B      C      D
0  False   True  False  False
1  False  False   True  False
2   True  False   True  False
3  False   True  False  False
4  False  False  False  False

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       5 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 288.0 bytes

# Handle Missing Values

In [27]:
df_cleaned = df.dropna(
    thresh=4
    ,axis = 1
)
df_cleaned.head()

     A  D
0  1.0  1
1  2.0  2
2  NaN  3
3  4.0  4
4  5.0  5

In [41]:
df_filled = df.fillna(
    0 \
    # df.mean() 
    # df.median()
    # method='ffill'
    # method='bfill'
    )
display(df_filled.head())

df_ffill = df.ffill()
display(df_ffill.head())


df_bfill = df.bfill()
df_bfill.head()

     A    B    C  D
0  1.0  0.0  1.0  1
1  2.0  2.0  0.0  2
2  0.0  3.0  0.0  3
3  4.0  0.0  4.0  4
4  5.0  5.0  5.0  5

     A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  1.0  2
2  2.0  3.0  1.0  3
3  4.0  3.0  4.0  4
4  5.0  5.0  5.0  5

     A    B    C  D
0  1.0  2.0  1.0  1
1  2.0  2.0  4.0  2
2  4.0  3.0  4.0  3
3  4.0  5.0  4.0  4
4  5.0  5.0  5.0  5

In [46]:
df_interpolate = df.interpolate(
    method='linear'
)
display(df.head())
display(df_interpolate.head())

     A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  NaN  2
2  NaN  3.0  NaN  3
3  4.0  NaN  4.0  4
4  5.0  5.0  5.0  5

     A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  2.0  2
2  3.0  3.0  3.0  3
3  4.0  4.0  4.0  4
4  5.0  5.0  5.0  5